#ifndef _ARINCDATA_H
#define _ARINCDATA_H

#include <stdbool.h>

typedef enum
{
    eCSCBord_NAV, //航法CSC
    eCSCBord_CTL, //制御CSC
    eCSCBord_GDE, //誘導CSC
    eCSCBord_AIR, //エアCSC
    eCSCBord_DAT, //データCSC
    eCSCBord_COM, //通信CSC
    eCSCBord_ECU  //ECU
}eCSCBord;

typedef enum
{
    eFlightPhase_PoweredAscent,   //動力上昇フェーズ TVC/EL Q<Qmin
    eFlightPhase_InertialClimb,   //慣性上昇フェーズ RCS Q>Qmin
    eFlightPhase_BallisticFlight, //弾道飛行フェーズ
    eFlightPhase_Reentry,         //再突入フェーズ 
    eFlightPhase_ReturnGlide,     //帰還滑空フェーズ  
    eFlightPhase_ChuteLanding     //パラシュート着陸フェーズ  
 }eFlightPhase;

typedef enum
{
    eRunMode_Normal,
    eRunMode_Hils,
    eRunMode_Sils
}eRunMode;

///////////////////////////////////////////////////////
//Arinc Data for Air
///////////////////////////////////////////////////////
typedef struct
{
    float    time_counter;        //Time Counter
}ArDataAirTimerStruct;

typedef struct
{
    bool    release_command;        //Release Command
}ArDataAirLaunchStruct;

typedef struct
{
    int    airdata_computer_status;        //AirData Computer Status
}ArDataAirStatusStruct;

typedef struct
{
    int    d1;        //D1
    int    d2;        //D2
    int    d3;        //D3
    int    d4;        //D4
    int    d5;        //D5
    int    d6;        //D6
    int    d7;        //D7
    int    d8;        //D8
    int    d9;        //D9
    int    a1;        //A１
    int    a2;        //A２
    int    a3;        //A３
    int    a4;        //A４
    float    angle_of_attack;        //Angle of Attack
    float    side_slip_angel;        //Side Slip Angle
    float    air_speed;        //Airspeed
    float    mach;        //Mach
    bool    system_failure_flag;        //System-failure flag
    bool    low_accuracy_flag;        //Low-accuracy flag
    float    pressure_altitude;        //Pressure Altitude
}ArDataAirFadsStruct;

typedef struct
{
    ArDataAirTimerStruct    timer;
    ArDataAirLaunchStruct    launch;
    ArDataAirStatusStruct    status;
    ArDataAirFadsStruct    fads;
}ArDataAirStrunt;

ArDataAirStrunt gArAirData;

///////////////////////////////////////////////////////
//Arinc Data for Navigation
///////////////////////////////////////////////////////
typedef struct
{
    float    time_counter;        //Time Counter
}ArDataNavTimerStruct;

typedef struct
{
